**`teams/delius-iaps/iaps_server`** terragrunt plan on `push` event [#40](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 2s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 2s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.0/1"
        name                  = "delius_iaps_install_base_packages"
      + supported_os_versions = []
        tags                  = {
            "add_net_framework_features-version"        = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"   = "1.0.0"
            "application"                               = "DELIUS-IAPS"
            "branch"                                    = "main"
            "business-unit"                             = "HMPPS"
            "delius_iaps_install_base_packages-version" = "0.1.0"
            "ec2launch-v2-windows-version"              = "1.0.0"
            "image-pipeline"                            = "delius_iaps_server"
            "image-recipe"                              = "delius_iaps_server/0.0.4"
            "infrastructure-configuration"              = "delius_iaps_server/0.0.4"
            "is-production"                             = "true"
            "os-version"                                = "windows server 2022"
            "owner"                                     = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                          = "patch"
            "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/add-net-framework-features/0.2.0/1"
        name                  = "add_net_framework_features"
      ~ tags                  = {
          ~ "image-recipe"                              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
          ~ "infrastructure-configuration"              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
            # (13 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "image-recipe"                              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
          ~ "infrastructure-configuration"              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
            # (13 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.0/1"
        name                  = "delius_iaps_install_base_packages"
      ~ tags                  = {
          ~ "image-recipe"                              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
          ~ "infrastructure-configuration"              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
            # (13 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "image-recipe"                              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
          ~ "infrastructure-configuration"              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
            # (13 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-iaps-server"
        name         = "delius_iaps_server"
      ~ tags         = {
          ~ "image-recipe"                              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
          ~ "infrastructure-configuration"              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
            # (13 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "image-recipe"                              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
          ~ "infrastructure-configuration"              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
            # (13 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "Delius IAPS server"
      + distribution_configuration_arn   = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-iaps-server"
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = (known after apply)
      + name                             = "delius_iaps_server"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "add_net_framework_features-version"        = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"   = "1.0.0"
          + "application"                               = "DELIUS-IAPS"
          + "branch"                                    = "main"
          + "business-unit"                             = "HMPPS"
          + "delius_iaps_install_base_packages-version" = "0.1.0"
          + "ec2launch-v2-windows-version"              = "1.0.0"
          + "image-pipeline"                            = "delius_iaps_server"
          + "image-recipe"                              = "delius_iaps_server/0.0.5"
          + "infrastructure-configuration"              = "delius_iaps_server/0.0.5"
          + "is-production"                             = "true"
          + "os-version"                                = "windows server 2022"
          + "owner"                                     = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                          = "patch"
          + "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      + tags_all                         = {
          + "add_net_framework_features-version"        = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"   = "1.0.0"
          + "application"                               = "DELIUS-IAPS"
          + "branch"                                    = "main"
          + "business-unit"                             = "HMPPS"
          + "delius_iaps_install_base_packages-version" = "0.1.0"
          + "ec2launch-v2-windows-version"              = "1.0.0"
          + "image-pipeline"                            = "delius_iaps_server"
          + "image-recipe"                              = "delius_iaps_server/0.0.5"
          + "infrastructure-configuration"              = "delius_iaps_server/0.0.5"
          + "is-production"                             = "true"
          + "os-version"                                = "windows server 2022"
          + "owner"                                     = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                          = "patch"
          + "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE"
          + schedule_expression                = "cron(0 0 2 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.4" -> (known after apply)
      ~ date_created      = "2023-01-03T16:54:41.929Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.4" -> (known after apply)
        name              = "delius_iaps_server"
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Windows" -> (known after apply)
      ~ tags              = {
          + "delius_iaps_install_base_packages-version" = "0.1.0"
          ~ "image-recipe"                              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
          ~ "infrastructure-configuration"              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
            # (12 unchanged elements hidden)
        }
      ~ tags_all          = {
          + "delius_iaps_install_base_packages-version" = "0.1.0"
          ~ "image-recipe"                              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
          ~ "infrastructure-configuration"              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
            # (12 unchanged elements hidden)
        }
      + user_data_base64  = (known after apply)
      ~ version           = "0.0.4" -> "0.0.5" # forces replacement
      - working_directory = "" -> null
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/xvdf" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - snapshot_id           = "snap-04435aa8246764616" -> null
              - throughput            = 0 -> null
              - volume_size           = 7 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/xvdf"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + snapshot_id           = "snap-04435aa8246764616"
              + volume_size           = 7
              + volume_type           = "gp3"
            }
        }

      + component { # forces replacement
          + component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.0/1" # forces replacement
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-4" -> (known after apply)
      ~ date_created                  = "2023-01-03T16:54:40.132Z" -> (known after apply)
      ~ date_updated                  = "2023-01-04T16:00:35.188Z" -> (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-4" -> (known after apply)
      ~ name                          = "delius_iaps_server_0_0_4" -> "delius_iaps_server_0_0_5" # forces replacement
      ~ resource_tags                 = {
          ~ "image-recipe"                              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
          ~ "infrastructure-configuration"              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
            # (13 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "image-recipe"                              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
          ~ "infrastructure-configuration"              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
            # (13 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "image-recipe"                              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
          ~ "infrastructure-configuration"              = "delius_iaps_server/0.0.4" -> "delius_iaps_server/0.0.5"
            # (13 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 3 to change, 2 to destroy.

```
